; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-4nodes-1000size-3degree-100mindistance-2trucks-3packages-102seed

(define (problem transport-two-cities-sequential-4nodes-1000size-3degree-100mindistance-2trucks-3packages-102seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 630,366 -> 151,692
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 58)
  ; 151,692 -> 630,366
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 58)
  ; 173,567 -> 151,692
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 13)
  ; 151,692 -> 173,567
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 13)
  ; 173,567 -> 630,366
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 50)
  ; 630,366 -> 173,567
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 50)
  ; 729,676 -> 151,692
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 58)
  ; 151,692 -> 729,676
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 58)
  ; 729,676 -> 630,366
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 33)
  ; 630,366 -> 729,676
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 33)
  ; 729,676 -> 173,567
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 57)
  ; 173,567 -> 729,676
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 57)
  ; 2393,299 -> 2622,186
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 26)
  ; 2622,186 -> 2393,299
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 26)
  ; 2632,439 -> 2622,186
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 26)
  ; 2622,186 -> 2632,439
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 26)
  ; 2632,439 -> 2393,299
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 28)
  ; 2393,299 -> 2632,439
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 28)
  ; 2579,595 -> 2622,186
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 42)
  ; 2622,186 -> 2579,595
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 42)
  ; 2579,595 -> 2393,299
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 35)
  ; 2393,299 -> 2579,595
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 35)
  ; 2579,595 -> 2632,439
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 17)
  ; 2632,439 -> 2579,595
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 17)
  ; 729,676 <-> 2393,299
  (road city-1-loc-4 city-2-loc-2)
  (= (road-length city-1-loc-4 city-2-loc-2) 171)
  (road city-2-loc-2 city-1-loc-4)
  (= (road-length city-2-loc-2 city-1-loc-4) 171)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-2)
  (at package-3 city-1-loc-4)
  (at truck-1 city-2-loc-4)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-1)
  (at package-2 city-2-loc-2)
  (at package-3 city-2-loc-4)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-2 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 3
2. (drive truck-2 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 3
3. (pick-up truck-2 city-1-loc-2 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-2) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 3
4. (drive truck-2 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 3
5. (pick-up truck-2 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 3
6. (drive truck-2 city-1-loc-1 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 3
7. (drive truck-2 city-1-loc-4 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 3
8. (drop truck-2 city-2-loc-2 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-0)
   added: (at package-2 city-2-loc-2) (capacity truck-2 capacity-1)
   goals met: 1 of 3
9. (drive truck-2 city-2-loc-2 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-4)
   goals met: 1 of 3
10. (pick-up truck-2 city-1-loc-4 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-4) (capacity truck-2 capacity-1)
   added: (in package-3 truck-2) (capacity truck-2 capacity-0)
   goals met: 1 of 3
11. (drive truck-2 city-1-loc-4 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-2)
   goals met: 1 of 3
12. (drive truck-2 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-1)
   goals met: 1 of 3
13. (drop truck-2 city-2-loc-1 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-0)
   added: (at package-1 city-2-loc-1) (capacity truck-2 capacity-1)
   goals met: 2 of 3
14. (drive truck-2 city-2-loc-1 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-4)
   goals met: 2 of 3
15. (drop truck-2 city-2-loc-4 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-1)
   added: (at package-3 city-2-loc-4) (capacity truck-2 capacity-2)
   goals met: 3 of 3
